main.floors.MT42=
{
    "floorId": "MT42",
    "title": "魔塔 第42层",
    "name": "第 42 层",
    "width": 13,
    "height": 13,
    "map": [
    [330,330,330,330,330,330,330,330,330,330,330,330,330],
    [330, 87,  0,  0,  1,  0,  0, 23,  1, 21, 22, 21,330],
    [330,  0,  0,204,  1,  0,  0,  0,  1, 21, 21, 21,330],
    [330,  1,  1, 81,  1,  0,  0,  0,  1,  1,  0,  1,330],
    [330,121,  0,  0,  1,  1,228,  1,  1,219,  0,220,330],
    [330,  0,  0,204, 81,  0,  0,  0, 81,  0,  0,  0,330],
    [330, 81,  1,  1,  1,  1,  0,  1,  1,  0,  0,219,330],
    [330,  0,  0,  0,  1,  0,  0,  0,  1,  1,  0,  1,330],
    [330,  1,  1,207,  1,  0,  0,  0,  1,246,  0,246,330],
    [330, 32, 21, 21,  1,  1,  0,  1,  1,  1,  0,  1,330],
    [330,207,  1,  1,  1,  0,226,  0,  1, 21, 21, 21,330],
    [330, 21, 21, 28,  1,  0, 88,  0,  1, 21, 22, 21,330],
    [330,330,330,330,330,330,330,330,330,330,330,330,330]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 5,
    "defaultGround": "ground",
    "bgm": "section5.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,4": [
            "\t[老登,man]巫师会用魔法攻击路过的人 在2个魔法警卫间通过会使你的生命减少一半",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,10": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "fgmap": [

],
    "upFloor": [
        1,
        2
    ],
    "downFloor": [
        5,
        11
    ],
    "autoEvent": {},
    "beforeBattle": {
        "6,10": [
            {
                "type": "if",
                "condition": "(status:direction==='down')",
                "true": [],
                "false": [
                    "\t[骑士队长,yellowKnight]啊！又是你！！",
                    {
                        "type": "move",
                        "time": 200,
                        "keep": true,
                        "steps": [
                            "up:2"
                        ]
                    },
                    {
                        "type": "setBlock",
                        "number": "redKing",
                        "loc": [
                            [
                                6,
                                6
                            ]
                        ],
                        "time": 500
                    },
                    "\t[魔王,redKing]你敢临阵脱逃！",
                    "\t[骑士队长,yellowKnight]哦，抱歉，大王，我打不过这个勇士，不得不逃，饶了我吧",
                    "\t[redKing]你说什么？你敢再说一次！我最讨厌的就是事后道歉。魔塔不需要像你这样的败类，来人给我杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀杀了。",
                    {
                        "type": "setBlock",
                        "number": "whiteKing",
                        "loc": [
                            [
                                6,
                                7
                            ],
                            [
                                5,
                                8
                            ],
                            [
                                6,
                                9
                            ],
                            [
                                7,
                                8
                            ]
                        ],
                        "time": 500
                    },
                    "\t[骑士队长,yellowKnight]饶命啊",
                    {
                        "type": "playSound",
                        "name": "attack.mp3"
                    },
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                8
                            ]
                        ],
                        "remove": true,
                        "time": 500
                    },
                    {
                        "type": "animate",
                        "name": "hand",
                        "loc": [
                            6,
                            8
                        ]
                    },
                    "\t[魔王,redKing]虽然我刚才态度异常，但别担心, 在决斗时，我不会像刚才这个无用的家伙一样让手下一拥而上。我期待着与你决斗。",
                    {
                        "type": "hide",
                        "loc": [
                            [
                                6,
                                6
                            ],
                            [
                                6,
                                7
                            ],
                            [
                                5,
                                8
                            ],
                            [
                                7,
                                8
                            ],
                            [
                                6,
                                9
                            ]
                        ],
                        "remove": true,
                        "time": 500
                    },
                    {
                        "type": "hide",
                        "remove": true,
                        "time": 0
                    }
                ]
            }
        ]
    },
    "cannotMoveIn": {},
    "bg2map": [],
    "fg2map": []
}