main.floors.MT47=
{
    "floorId": "MT47",
    "title": "魔塔 第47层",
    "name": "第 47 层",
    "width": 13,
    "height": 13,
    "map": [
    [330,330,330,330,330,330,330,330,330,330,330,330,330],
    [330, 87,  0, 82,  0,  0,  0, 81,  0,  0,  0, 21,330],
    [330,  0,  0,  1,  0,122,  0,  1,229,  1,  1, 28,330],
    [330,  0,  1,  1,  1,  1,  1,  1,  0,204,  0, 21,330],
    [330,  0,  1,  0, 81,220,  0,  1, 81,  1,  1,  1,330],
    [330,  0,  1,207,  1,  0,219,  1,  0,219,  0,  0,330],
    [330,  0, 81,  0,  1,  0,  0,  1, 21,  0,  0,207,330],
    [330,  0,  1,  0,  1, 22, 21,  1,  1,  1,  1, 81,330],
    [330,  0,  1,  0, 82, 27, 28,  1,  0,  0,  0,  0,330],
    [330,229,  1,  1,  1,  1,  1,  1,204,  1,  1,  1,330],
    [330,  0,  0,  1, 31,  0, 27,  1,  0,  1,  0,  0,330],
    [330,  0,  0, 81,  0,219,  0, 81,  0,  0,  0, 88,330],
    [330,330,330,330,330,330,330,330,330,330,330,330,330]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 5,
    "defaultGround": "ground",
    "bgm": "section5.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "5,2": [
            {
                "type": "comment",
                "text": "\\d\\c[24]\\i[I361]\\c\r[rgb(244,108,108)](-4000G)\\c[24]\\i[T358]\\i[earthquake]\\c\r[rgb(224,210,69)](+1)"
            },
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "\t[商人,woman]如果要打败魔龙你需要 圣剑 圣盾 屠龙匕 或更高等级的装备",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ],
                "false": [
                    {
                        "type": "choices",
                        "text": "\t[商人,woman]我有一张地震卷轴，只要4000金币，你要吗？",
                        "choices": [
                            {
                                "text": "我太需要了",
                                "need": "status:money>=4000",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:money",
                                        "operator": "-=",
                                        "value": "4000"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "item:earthquake",
                                        "operator": "+=",
                                        "value": "1"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "switch:A",
                                        "value": "true"
                                    }
                                ]
                            },
                            {
                                "text": "离开",
                                "action": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "fgmap": [

],
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "upFloor": [
        2,
        1
    ],
    "downFloor": [
        11,
        10
    ],
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "bg2map": [],
    "fg2map": []
}