main.floors.MT6=
{
    "floorId": "MT6",
    "title": "魔塔 第06层",
    "name": "第 6 层",
    "width": 13,
    "height": 13,
    "map": [
    [330,330,330,330,330,330,330,330,330,330,330,330,330],
    [330, 88,  1, 21, 21,  1,  0,217,  0, 21,201,  0,330],
    [330,  0,  1, 21, 21,  1,  0,  1,  1,  1,  1, 81,330],
    [330,  0,  1,  1,202,  1,  0,  1, 31,  0,209,  0,330],
    [330,  0, 81, 81,  0, 81,  0,  1,122,  0,  0,205,330],
    [330,  0,  1,  1,  1,  1,  0,  1,  1,  1,  1,  1,330],
    [330,  0,  0,202,217,  0, 21,  0,209,210,  0,  0,330],
    [330,  1,  1,  1,  1,  1,  0,  1,  1,  1,  1,  0,330],
    [330,217,  0,  0,121,  1,  0, 81, 81,  0, 81,  0,330],
    [330,  0,205,  0, 28,  1,  0,  1,  1,202,  1,202,330],
    [330, 81,  1,  1,  1,  1,  0,  1,  0,  0,  1,  0,330],
    [330,  0,201,  0,  0,209,  0,  1, 31, 31,  1, 87,330],
    [330,330,330,330,330,330,330,330,330,330,330,330,330]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "section1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,8": [
            "\t[老登,man]如果你向商人购买商品，那么他们会在之后向你透露一些重要情报。",
            {
                "type": "hide",
                "remove": true,
                "time": 200
            }
        ],
        "8,4": [
            {
                "type": "comment",
                "text": "\\d\\c[24]\\i[I361]\\c\r[rgb(244,108,108)](-50G)\\c[24]\\i[T358]\\i[blueKey]\\c\r[rgb(170,170,221)](+1)"
            },
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "\t[商人,woman]这座魔塔共有50层，每10层为一个区域。每个区域各有一个头目掌管该区域。你若不能击败他们便无法前往下一个区域。",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ],
                "false": [
                    {
                        "type": "choices",
                        "text": "\t[商人,woman]我50金币特价卖一把蓝钥匙。你买吗？",
                        "choices": [
                            {
                                "text": "我太需要了",
                                "need": "status:money>=50",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:money",
                                        "operator": "-=",
                                        "value": "50"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "item:blueKey",
                                        "operator": "+=",
                                        "value": "1"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "switch:A",
                                        "value": "true"
                                    }
                                ]
                            },
                            {
                                "text": "离开",
                                "action": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "fgmap": [

],
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "upFloor": [
        11,
        10
    ],
    "downFloor": [
        1,
        2
    ],
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "bg2map": [],
    "fg2map": []
}