main.floors.MT7=
{
    "floorId": "MT7",
    "title": "魔塔 第07层",
    "name": "第 7 层",
    "width": 13,
    "height": 13,
    "map": [
    [330,330,330,330,330,330,330,330,330,330,330,330,330],
    [330, 87,  1, 27,  1,  0,122,  0,  1, 21,  1,201,330],
    [330,  0,  1, 31,  1,  0,  0,  0,  1, 21,  1,202,330],
    [330,  0,  1,205,  1,202,  1,210,  1, 31,  1,201,330],
    [330,  0,  1,  0,  1,  0,  1,  0,  1,  0,  1,  0,330],
    [330, 81,  1, 81,  1, 82,  1, 81,  1,209,  1, 81,330],
    [330,  0,210,  0,217,  0,  0,  0,  0,  0,  0,  0,330],
    [330, 81,  1, 81,  1, 81,  1, 81,  1,210,  1, 81,330],
    [330,  0,  1,  0,  1,  0,  1,  0,  1,  0,  1,  0,330],
    [330,  0,  1,  0,  1,205,  1,202,  1, 32,  1,  0,330],
    [330,201,  1,201,  1, 21,  1,217,  1, 21,  1,  0,330],
    [330,  0,202,  0,  1, 21,  1, 32,  1, 21,  1, 88,330],
    [330,330,330,330,330,330,330,330,330,330,330,330,330]
],
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground",
    "bgm": "section1.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": [
            {
                "type": "comment",
                "text": "\\d\\c[24]\\i[I361]\\c\r[rgb(244,108,108)](-50G)\\c[24]\\i[T358]\\i[yellowKey]\\c\r[rgb(224,210,69)](+5)"
            },
            {
                "type": "if",
                "condition": "switch:A",
                "true": [
                    "\t[商人,woman]当你在祭坛供奉金币时，你最好是提升防御力而不是攻击力。但如果完全不提升攻击力的话，之后会有你没法打败的怪物。",
                    {
                        "type": "hide",
                        "remove": true
                    }
                ],
                "false": [
                    {
                        "type": "choices",
                        "text": "\t[商人,woman]我50金币卖5把黄钥匙。你买吗？",
                        "choices": [
                            {
                                "text": "我太需要了",
                                "need": "status:money>=50",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "status:money",
                                        "operator": "-=",
                                        "value": "50"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "item:yellowKey",
                                        "operator": "+=",
                                        "value": "5"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "switch:A",
                                        "value": "true"
                                    }
                                ]
                            },
                            {
                                "text": "离开",
                                "action": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "cannotMove": {},
    "bgmap": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "fgmap": [

],
    "upFloor": [
        1,
        2
    ],
    "downFloor": [
        11,
        10
    ],
    "autoEvent": {},
    "beforeBattle": {},
    "cannotMoveIn": {},
    "bg2map": [],
    "fg2map": []
}